Shape of this cable tray type.
  Namespace:   Autodesk.Revit.DB.Electrical
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public CableTrayShape ShapeType { get; }
  Visual Basic
Public ReadOnly Property ShapeType As CableTrayShape
	Get
  Visual C++
public:
property CableTrayShape ShapeType {
	CableTrayShape get ();
}
 See Also
  CableTrayType Class
  Autodesk.Revit.DB.Electrical Namespace